experiment_scripts/scripts/EPOCH_PIN/results-C/opimq+pin/sysbench/40-29
My process ID is 20
After Trap
sysbench 1.1.0-df89d34 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           13145
        other:                           0
        total:                           13145
    transactions:                        13145  (109.54 per sec.)
    queries:                             13145  (109.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      109.5364
    time elapsed:                        120.0058s
    total number of events:              13145

Latency (ms):
         min:                                    3.87
         avg:                                    9.12
         max:                                   35.25
         95th percentile:                       11.45
         sum:                               119941.67

Threads fairness:
    events (avg/stddev):           13145.0000/0.00
    execution time (avg/stddev):   119.9417/0.00