experiment_scripts/scripts/EPOCH_PIN/results-C/opimq+pin/sysbench/40-34
My process ID is 20
After Trap
sysbench 1.1.0-df89d34 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           13151
        other:                           0
        total:                           13151
    transactions:                        13151  (109.59 per sec.)
    queries:                             13151  (109.59 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      109.5892
    time elapsed:                        120.0027s
    total number of events:              13151

Latency (ms):
         min:                                    3.89
         avg:                                    9.12
         max:                                   39.81
         95th percentile:                       11.45
         sum:                               119940.30

Threads fairness:
    events (avg/stddev):           13151.0000/0.00
    execution time (avg/stddev):   119.9403/0.00